#+OPTIONS: tags:nil
#+EXCLUDE_TAGS: startup codeblocks trash hide

* Startup :startup:
#+begin_src elisp :exports none
(org-babel-do-load-languages 
 'org-babel-load-languages
 '((python t) (sh t)))
(require 'ob-ipython)
(setq org-confirm-babel-evaluate nil)   ;don't prompt me to confirm everytime I want to evaluate a block
(setq ob-ipython-command "ipython-2.7")

;;; display/update images in the buffer after I evaluate
;; (add-hook 'org-babel-after-execute-hook 'org-display-inline-images)
(setq org-latex-default-figure-position "!tb")
(setq org-latex-default-table-position "!tb")

;; (defun shk-fix-inline-images ()
;;  (when org-inline-image-overlays
;;    (org-redisplay-inline-images)))
;; (add-hook 'org-babel-after-execute-hook 'shk-fix-inline-images)
#+end_src

#+RESULTS:
: !tb

#+BEGIN_SRC ipython :session lfm :exports none
  %matplotlib inline
  %config InlineBackend.figure_format = 'png'
  import matplotlib
  matplotlib.rcParams['font.size'] = 8
  matplotlib.rcParams['legend.fontsize'] = 8
  import matplotlib.pyplot as plt
  import numpy as np

  from SimDataDB import *


  from collections import defaultdict
  from itertools import cycle

  colors = cycle("rgbycmk")
  markers = cycle("+x*d")
  colorkey = defaultdict(lambda :colors.next())
  markerkey = defaultdict(lambda :markers.next())


  # Domain Parameters
  domW = 16.0e3 # mm
  domH = 16.0e3 # mm
  young = 60.0 # kg / mm ms^2
  nu = 0.0
  fracture_pressure = 0.1
  fracture_length = 0.7e3

  def analytical(X):
      P = fracture_pressure
      E = young
      H = domH/2.0
      a = fracture_length/2.0
      a2 = a**2
      C = 0.0
      Zhat = lambda z : np.sqrt( -a2 + z**2.0 ) - z - C *z
      Z = lambda z : z/np.sqrt(-a2 + z**2.0 ) - 1 - C

      ux = lambda z : P/(2.0*E/(2.0*(1.0-nu))) * (
          (2.0-4.0*nu)/2.0 * np.real(Zhat(z)) - np.imag(z) * np.imag(Z(z)))
      uy = lambda z : P/(2.0*E/(2.0*(1.0-nu))) * (
          (4.0-4.0*nu)/2.0 * np.imag(Zhat(z)) - np.imag(z) * np.real(Z(z)))

      y = np.empty(X.shape)
      y[:,0] = X[:,0] + np.sign(X[:,0]-H)*ux( np.abs(X[:,0]-H) + 1j*np.abs(X[:,1]-H))
      y[:,1] = X[:,1] + np.sign(X[:,1]-H)*uy( np.abs(X[:,0]-H) + 1j*np.abs(X[:,1]-H))
      return y

  def vert_slice(x):
      NP = int(x.shape[0]**0.5)
      base = NP/2
      return x[base:(base+NP*(NP-1))+1:NP ,1]
  def horz_slice(x):
      NP = int(x.shape[0]**0.5)
      base = NP*NP/2
      return x[ base:base+NP ,0]
  # Load the DB
  sdb = SimDataDB("/Users/afq/Google Drive/ResultDatabases/lfm.db")
  conn = sdb.Get_Connection()
  c = conn.cursor()
  def Query(string):
        c.execute(string)
        res = c.fetchall()
        res.sort()
        return [ list(k) for k in res ] 
#+END_SRC

#+RESULTS:

